---
kind: other
id: Properties.T:Autodesk.Revit.DB.HermiteSurface
source: html/e0ee5bda-5ba5-9758-82a4-5bb03985cb53.htm
---
# HermiteSurface Properties

Specifies whether the .NET object represents a valid Revit entity.